app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"  ORDER BY "movies"."title" ASC
SELECT "movies".* FROM "movies"  ORDER BY "movies"."release_date" ASC
SELECT "movies".* FROM "movies"
---
  def index
    if params[:sort] == "title"
      @title_flag = "hilite"
      @date_flag = false
      @movies = Movie.all.order(:title)
    elsif params[:sort] == "date"
      @title_flag = false
      @date_flag = "hilite"
      @movies = Movie.all.order(:release_date)
    else
      @title_flag = @date_flag = false
      @movies = Movie.all

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ? LIMIT 1  [["director", "Ron Clements"]]
---
  def movies_with_same_director
    movie = Movie.find(params[:id])
    director = movie.director

    if director == nil or director == ""
      flash[:notice] = "'#{movie.title}' doesn't have a director recorded."
      redirect_to movies_path
    else
      @movies = Movie.find_movies_by_director(director)